Tekla Open API Reference for Tekla Structures 2025
Matrix.Multiply Operator
Overload List
Name | Description
Multiply(Matrix, IEnumerable<Point>)
 Transforms the given points using the given matrix.
Multiply(Matrix, Matrix)
 Multiplies (combines) two transformation matrices.
Multiply(Matrix, Point)
 Transforms the given point using the given matrix.
Top
See Also
Reference
Matrix Class
Tekla.Structures.Geometry3d Namespace